__________________________________________________________________________________________________
Layer (type)                                Output Shape                           Param #        
==================================================================================================
input_3 (InputLayer)                        (None, None, None, 3)                  0              
__________________________________________________________________________________________________
block1_conv1 (Conv2D)                       (None, None, None, 64)                 1792           
__________________________________________________________________________________________________
block1_conv2 (Conv2D)                       (None, None, None, 64)                 36928          
__________________________________________________________________________________________________
block1_pool (MaxPooling2D)                  (None, None, None, 64)                 0              
__________________________________________________________________________________________________
block2_conv1 (Conv2D)                       (None, None, None, 128)                73856          
__________________________________________________________________________________________________
block2_conv2 (Conv2D)                       (None, None, None, 128)                147584         
__________________________________________________________________________________________________
block2_pool (MaxPooling2D)                  (None, None, None, 128)                0              
__________________________________________________________________________________________________
block3_conv1 (Conv2D)                       (None, None, None, 256)                295168         
__________________________________________________________________________________________________
block3_conv2 (Conv2D)                       (None, None, None, 256)                590080         
__________________________________________________________________________________________________
block3_conv3 (Conv2D)                       (None, None, None, 256)                590080         
__________________________________________________________________________________________________
block3_pool (MaxPooling2D)                  (None, None, None, 256)                0              
__________________________________________________________________________________________________
block4_conv1 (Conv2D)                       (None, None, None, 512)                1180160        
__________________________________________________________________________________________________
block4_conv2 (Conv2D)                       (None, None, None, 512)                2359808        
__________________________________________________________________________________________________
block4_conv3 (Conv2D)                       (None, None, None, 512)                2359808        
__________________________________________________________________________________________________
block4_pool (MaxPooling2D)                  (None, None, None, 512)                0              
__________________________________________________________________________________________________
block5_conv1 (Conv2D)                       (None, None, None, 512)                2359808        
__________________________________________________________________________________________________
block5_conv2 (Conv2D)                       (None, None, None, 512)                2359808        
__________________________________________________________________________________________________
block5_conv3 (Conv2D)                       (None, None, None, 512)                2359808        
__________________________________________________________________________________________________
block5_pool (MaxPooling2D)                  (None, None, None, 512)                0              
==================================================================================================
Total params: 14,714,688
Trainable params: 14,714,688
Non-trainable params: 0
__________________________________________________________________________________________________
